app/views/presentations/_form.html.erb

    <div>
      <%= collection_select( :presentation, :id, User.all, :id, :name, {}, {:multiple => true} ) %>
---
SELECT "users".* FROM "users"