app/views/home/index.html.erb

SELECT "users".* FROM "users"
---
			<ul>
			<% User.all.each do |user| %>