app/controllers/presentations_controller.rb

  def index
    @presentations = Presentation.all
---
SELECT "presentations".* FROM "presentations"

  def create
    @presentation = Presentation.new(presentation_params)

    respond_to do |format|
      if @presentation.save
---
INSERT INTO "presentations" ("title", "emails", "description", "grade", "graded", "created_at", "updated_at") VALUES ('AAAA', NULL, '', 100, 1, '2024-12-08 01:07:05.666704', '2024-12-08 01:07:05.666704') RETURNING "id"

  def destroy
    @presentation.destroy!
---
DELETE FROM "presentations" WHERE "presentations"."id" = 3

    def set_presentation
      @presentation = Presentation.find(params.expect(:id))
---
SELECT "presentations".* FROM "presentations" WHERE "presentations"."id" = 1 LIMIT 1